c1 = input("Введите первый цвет")
c2 = input("Введите второй цвет")
if c1 == "Красный" or c2 == "Красный":
    if c1 == "Синий" or c2 == "Синий":
        print("Фиолетовый")
    elif c1 == "Желтый" or c2 == "Желтый":
        print("Оранжевый")

elif c1 == "Синий" or c2 == "Синий":
    if c1 == "Красный" or c2 == "Красный":
        print("Фиолетовый")
    elif c1 == "Желтый" or c2 == "Желтый":
        print("Зеленый")

elif c1 == "Желтый" or c2 == "Желтый":
    if c1 == "Красный" or c2 == "Красный":
        print("Оранжевый")
    elif c1 == "Синий" or c2 == "Синий":
        print("Зеленый")
else:
    print("Требуется ввести основные цвет")
